docs/architecture/diagrams/mermaid/structurizr-Components_flarelette_demo_ui.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["archlette-demo - flarelette-demo-ui - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>User</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>End user who interacts with<br />the Flarelette Demo UI</div>"]
    style 1 fill:#08427b,stroke:#052e56,color:#ffffff

    subgraph 5 ["flarelette-demo-ui"]
      style 5 fill:#ffffff,stroke:#ac5b15,color:#ac5b15

      6("<div style='font-weight: bold'>layouts</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Component inferred from<br />directory: layouts</div>")
      style 6 fill:#85bbf0,stroke:#5d82a8,color:#000000
      7("<div style='font-weight: bold'>pages</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Home Page - Landing page for<br />Flarelette Demo application</div>")
      style 7 fill:#85bbf0,stroke:#5d82a8,color:#000000
      8("<div style='font-weight: bold'>env</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Environment variable type<br />definitions for Astro project</div>")
      style 8 fill:#85bbf0,stroke:#5d82a8,color:#000000
      9("<div style='font-weight: bold'>types</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Shared types for the</div>")
      style 9 fill:#85bbf0,stroke:#5d82a8,color:#000000
    end

    7-- "<div>Uses BaseLayout component</div><div style='font-size: 70%'></div>" -->6
    1-- "<div>Interacts with pages</div><div style='font-size: 70%'></div>" -->7
  end
